app/controllers/posts_controller.rb

  def create
    @post = Post.new(params)
    @post.save
---
INSERT INTO "posts" ("title", "description", "created_at", "updated_at") VALUES (?, ?, ?, ?)  [["title", "First Even Post"], ["description", "lorem"], ["created_at", "2020-03-20 17:28:05.012961"], ["updated_at", "2020-03-20 17:28:05.012961"]]